src/xml/mark-as-read.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
               xmlns:m="http://schemas.microsoft.com/exchange/services/2006/messages"
               xmlns:t="http://schemas.microsoft.com/exchange/services/2006/types"
               xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <m:UpdateItem MessageDisposition="SaveOnly" ConflictResolution="AutoResolve">
            <m:ItemChanges>
                <t:ItemChange>
                    <t:Updates>
                        <t:SetItemField>
                            <t:FieldURI FieldURI="message:IsRead"/>
                            <t:Message>
                                <t:IsRead>true</t:IsRead>
                            </t:Message>
                        </t:SetItemField>
                    </t:Updates>
                </t:ItemChange>
            </m:ItemChanges>
            <m:ParentFolderIds>
                <t:DistinguishedFolderId Id="{Id}"/>
            </m:ParentFolderIds>
        </m:UpdateItem>
    </soap:Body>
</soap:Envelope>